luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.CRC1 */
#define IFX_PSI5_CH_RCRB_CRC1_OFF (5u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.CRC2 */
#define IFX_PSI5_CH_RCRB_CRC2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.CRC2 */
#define IFX_PSI5_CH_RCRB_CRC2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.CRC2 */
#define IFX_PSI5_CH_RCRB_CRC2_OFF (9u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.CRC3 */
#define IFX_PSI5_CH_RCRB_CRC3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.CRC3 */
#define IFX_PSI5_CH_RCRB_CRC3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.CRC3 */
#define IFX_PSI5_CH_RCRB_CRC3_OFF (13u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.CRC4 */
#define IFX_PSI5_CH_RCRB_CRC4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.CRC4 */
#define IFX_PSI5_CH_RCRB_CRC4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.CRC4 */
#define IFX_PSI5_CH_RCRB_CRC4_OFF (17u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.CRC5 */
#define IFX_PSI5_CH_RCRB_CRC5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.CRC5 */
#define IFX_PSI5_CH_RCRB_CRC5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.CRC5 */
#define IFX_PSI5_CH_RCRB_CRC5_OFF (21u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.FEC0 */
#define IFX_PSI5_CH_RCRB_FEC0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.FEC0 */
#define IFX_PSI5_CH_RCRB_FEC0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.FEC0 */
#define IFX_PSI5_CH_RCRB_FEC0_OFF (2u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.FEC1 */
#define IFX_PSI5_CH_RCRB_FEC1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.FEC1 */
#define IFX_PSI5_CH_RCRB_FEC1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.FEC1 */
#define IFX_PSI5_CH_RCRB_FEC1_OFF (6u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.FEC2 */
#define IFX_PSI5_CH_RCRB_FEC2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.FEC2 */
#define IFX_PSI5_CH_RCRB_FEC2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.FEC2 */
#define IFX_PSI5_CH_RCRB_FEC2_OFF (10u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.FEC3 */
#define IFX_PSI5_CH_RCRB_FEC3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.FEC3 */
#define IFX_PSI5_CH_RCRB_FEC3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.FEC3 */
#define IFX_PSI5_CH_RCRB_FEC3_OFF (14u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.FEC4 */
#define IFX_PSI5_CH_RCRB_FEC4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.FEC4 */
#define IFX_PSI5_CH_RCRB_FEC4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.FEC4 */
#define IFX_PSI5_CH_RCRB_FEC4_OFF (18u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.FEC5 */
#define IFX_PSI5_CH_RCRB_FEC5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.FEC5 */
#define IFX_PSI5_CH_RCRB_FEC5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.FEC5 */
#define IFX_PSI5_CH_RCRB_FEC5_OFF (22u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.MSG0 */
#define IFX_PSI5_CH_RCRB_MSG0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.MSG0 */
#define IFX_PSI5_CH_RCRB_MSG0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.MSG0 */
#define IFX_PSI5_CH_RCRB_MSG0_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.MSG1 */
#define IFX_PSI5_CH_RCRB_MSG1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.MSG1 */
#define IFX_PSI5_CH_RCRB_MSG1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.MSG1 */
#define IFX_PSI5_CH_RCRB_MSG1_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.MSG2 */
#define IFX_PSI5_CH_RCRB_MSG2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.MSG2 */
#define IFX_PSI5_CH_RCRB_MSG2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.MSG2 */
#define IFX_PSI5_CH_RCRB_MSG2_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.MSG3 */
#define IFX_PSI5_CH_RCRB_MSG3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.MSG3 */
#define IFX_PSI5_CH_RCRB_MSG3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.MSG3 */
#define IFX_PSI5_CH_RCRB_MSG3_OFF (12u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.MSG4 */
#define IFX_PSI5_CH_RCRB_MSG4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.MSG4 */
#define IFX_PSI5_CH_RCRB_MSG4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.MSG4 */
#define IFX_PSI5_CH_RCRB_MSG4_OFF (16u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.MSG5 */
#define IFX_PSI5_CH_RCRB_MSG5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.MSG5 */
#define IFX_PSI5_CH_RCRB_MSG5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.MSG5 */
#define IFX_PSI5_CH_RCRB_MSG5_OFF (20u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.VBS0 */
#define IFX_PSI5_CH_RCRB_VBS0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.VBS0 */
#define IFX_PSI5_CH_RCRB_VBS0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS0 */
#define IFX_PSI5_CH_RCRB_VBS0_OFF (3u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.VBS1 */
#define IFX_PSI5_CH_RCRB_VBS1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.VBS1 */
#define IFX_PSI5_CH_RCRB_VBS1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS1 */
#define IFX_PSI5_CH_RCRB_VBS1_OFF (7u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.VBS2 */
#define IFX_PSI5_CH_RCRB_VBS2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.VBS2 */
#define IFX_PSI5_CH_RCRB_VBS2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS2 */
#define IFX_PSI5_CH_RCRB_VBS2_OFF (11u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.VBS3 */
#define IFX_PSI5_CH_RCRB_VBS3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.VBS3 */
#define IFX_PSI5_CH_RCRB_VBS3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS3 */
#define IFX_PSI5_CH_RCRB_VBS3_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.VBS4 */
#define IFX_PSI5_CH_RCRB_VBS4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.VBS4 */
#define IFX_PSI5_CH_RCRB_VBS4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS4 */
#define IFX_PSI5_CH_RCRB_VBS4_OFF (19u)

/** \brief  Length for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_OFF (23u)

/** \brief  Length for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_LEN (1u)

