luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_LEN (2u)

/** \brief  Mask for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_MSK (0x3u)

/** \brief  Offset for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_OFF (3u)

/** \brief  Length for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_LEN (2u)

/** \brief  Mask for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_MSK (0x3u)

/** \brief  Offset for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_OFF (1u)

/** \brief  Length for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_OFF (5u)

/** \brief  Length for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_OFF (29u)

/** \brief  Length for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_OFF (28u)

/** \brief  Length for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_OFF (30u)

/** \brief  Length for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_LEN (3u)

/** \brief  Mask for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_OFF (24u)

/** \brief  Length for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_OFF (27u)

/** \brief  Length for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_LEN (24u)

/** \brief  Mask for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_MSK (0xffffffu)

/** \brief  Offset for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_LEN (3u)

/** \brief  Mask for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_OFF (1u)

/** \brief  Length for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_LEN (28u)

/** \brief  Mask for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_MSK (0xfffffffu)

/** \brief  Offset for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_LEN (3u)

/** \brief  Mask for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_LEN (2u)

/** \brief  Mask for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_MSK (0x3u)

/** \brief  Offset for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_OFF (7u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_OFF (22u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_OFF (6u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_OFF (14u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_OFF (25u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_OFF (24u)

