luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD47 */
#define IFX_PSI5_CH_SDRH_SD47_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD47 */
#define IFX_PSI5_CH_SDRH_SD47_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD47 */
#define IFX_PSI5_CH_SDRH_SD47_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD48 */
#define IFX_PSI5_CH_SDRH_SD48_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD48 */
#define IFX_PSI5_CH_SDRH_SD48_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD48 */
#define IFX_PSI5_CH_SDRH_SD48_OFF (16u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD49 */
#define IFX_PSI5_CH_SDRH_SD49_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD49 */
#define IFX_PSI5_CH_SDRH_SD49_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD49 */
#define IFX_PSI5_CH_SDRH_SD49_OFF (17u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD50 */
#define IFX_PSI5_CH_SDRH_SD50_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD50 */
#define IFX_PSI5_CH_SDRH_SD50_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD50 */
#define IFX_PSI5_CH_SDRH_SD50_OFF (18u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD51 */
#define IFX_PSI5_CH_SDRH_SD51_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD51 */
#define IFX_PSI5_CH_SDRH_SD51_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD51 */
#define IFX_PSI5_CH_SDRH_SD51_OFF (19u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD52 */
#define IFX_PSI5_CH_SDRH_SD52_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD52 */
#define IFX_PSI5_CH_SDRH_SD52_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD52 */
#define IFX_PSI5_CH_SDRH_SD52_OFF (20u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD53 */
#define IFX_PSI5_CH_SDRH_SD53_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD53 */
#define IFX_PSI5_CH_SDRH_SD53_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD53 */
#define IFX_PSI5_CH_SDRH_SD53_OFF (21u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD54 */
#define IFX_PSI5_CH_SDRH_SD54_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD54 */
#define IFX_PSI5_CH_SDRH_SD54_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD54 */
#define IFX_PSI5_CH_SDRH_SD54_OFF (22u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD55 */
#define IFX_PSI5_CH_SDRH_SD55_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD55 */
#define IFX_PSI5_CH_SDRH_SD55_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD55 */
#define IFX_PSI5_CH_SDRH_SD55_OFF (23u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD56 */
#define IFX_PSI5_CH_SDRH_SD56_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD56 */
#define IFX_PSI5_CH_SDRH_SD56_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD56 */
#define IFX_PSI5_CH_SDRH_SD56_OFF (24u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD57 */
#define IFX_PSI5_CH_SDRH_SD57_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD57 */
#define IFX_PSI5_CH_SDRH_SD57_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD57 */
#define IFX_PSI5_CH_SDRH_SD57_OFF (25u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD58 */
#define IFX_PSI5_CH_SDRH_SD58_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD58 */
#define IFX_PSI5_CH_SDRH_SD58_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD58 */
#define IFX_PSI5_CH_SDRH_SD58_OFF (26u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD59 */
#define IFX_PSI5_CH_SDRH_SD59_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD59 */
#define IFX_PSI5_CH_SDRH_SD59_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD59 */
#define IFX_PSI5_CH_SDRH_SD59_OFF (27u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD60 */
#define IFX_PSI5_CH_SDRH_SD60_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD60 */
#define IFX_PSI5_CH_SDRH_SD60_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD60 */
#define IFX_PSI5_CH_SDRH_SD60_OFF (28u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD61 */
#define IFX_PSI5_CH_SDRH_SD61_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD61 */
#define IFX_PSI5_CH_SDRH_SD61_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD61 */
#define IFX_PSI5_CH_SDRH_SD61_OFF (29u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD62 */
#define IFX_PSI5_CH_SDRH_SD62_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD62 */
#define IFX_PSI5_CH_SDRH_SD62_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD62 */
#define IFX_PSI5_CH_SDRH_SD62_OFF (30u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD63 */
#define IFX_PSI5_CH_SDRH_SD63_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD63 */
#define IFX_PSI5_CH_SDRH_SD63_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD63 */
#define IFX_PSI5_CH_SDRH_SD63_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_OFF (10u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_OFF (11u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_OFF (12u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_OFF (13u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_OFF (14u)

