luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD16 */
#define IFX_PSI5_CH_SDRL_SD16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD16 */
#define IFX_PSI5_CH_SDRL_SD16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD16 */
#define IFX_PSI5_CH_SDRL_SD16_OFF (16u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD17 */
#define IFX_PSI5_CH_SDRL_SD17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD17 */
#define IFX_PSI5_CH_SDRL_SD17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD17 */
#define IFX_PSI5_CH_SDRL_SD17_OFF (17u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD18 */
#define IFX_PSI5_CH_SDRL_SD18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD18 */
#define IFX_PSI5_CH_SDRL_SD18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD18 */
#define IFX_PSI5_CH_SDRL_SD18_OFF (18u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD19 */
#define IFX_PSI5_CH_SDRL_SD19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD19 */
#define IFX_PSI5_CH_SDRL_SD19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD19 */
#define IFX_PSI5_CH_SDRL_SD19_OFF (19u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD1 */
#define IFX_PSI5_CH_SDRL_SD1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD1 */
#define IFX_PSI5_CH_SDRL_SD1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD1 */
#define IFX_PSI5_CH_SDRL_SD1_OFF (1u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD20 */
#define IFX_PSI5_CH_SDRL_SD20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD20 */
#define IFX_PSI5_CH_SDRL_SD20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD20 */
#define IFX_PSI5_CH_SDRL_SD20_OFF (20u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD21 */
#define IFX_PSI5_CH_SDRL_SD21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD21 */
#define IFX_PSI5_CH_SDRL_SD21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD21 */
#define IFX_PSI5_CH_SDRL_SD21_OFF (21u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD22 */
#define IFX_PSI5_CH_SDRL_SD22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD22 */
#define IFX_PSI5_CH_SDRL_SD22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD22 */
#define IFX_PSI5_CH_SDRL_SD22_OFF (22u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD23 */
#define IFX_PSI5_CH_SDRL_SD23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD23 */
#define IFX_PSI5_CH_SDRL_SD23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD23 */
#define IFX_PSI5_CH_SDRL_SD23_OFF (23u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD24 */
#define IFX_PSI5_CH_SDRL_SD24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD24 */
#define IFX_PSI5_CH_SDRL_SD24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD24 */
#define IFX_PSI5_CH_SDRL_SD24_OFF (24u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD25 */
#define IFX_PSI5_CH_SDRL_SD25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD25 */
#define IFX_PSI5_CH_SDRL_SD25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD25 */
#define IFX_PSI5_CH_SDRL_SD25_OFF (25u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD26 */
#define IFX_PSI5_CH_SDRL_SD26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD26 */
#define IFX_PSI5_CH_SDRL_SD26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD26 */
#define IFX_PSI5_CH_SDRL_SD26_OFF (26u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD27 */
#define IFX_PSI5_CH_SDRL_SD27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD27 */
#define IFX_PSI5_CH_SDRL_SD27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD27 */
#define IFX_PSI5_CH_SDRL_SD27_OFF (27u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD28 */
#define IFX_PSI5_CH_SDRL_SD28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD28 */
#define IFX_PSI5_CH_SDRL_SD28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD28 */
#define IFX_PSI5_CH_SDRL_SD28_OFF (28u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD29 */
#define IFX_PSI5_CH_SDRL_SD29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD29 */
#define IFX_PSI5_CH_SDRL_SD29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD29 */
#define IFX_PSI5_CH_SDRL_SD29_OFF (29u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD2 */
#define IFX_PSI5_CH_SDRL_SD2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD2 */
#define IFX_PSI5_CH_SDRL_SD2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD2 */
#define IFX_PSI5_CH_SDRL_SD2_OFF (2u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD30 */
#define IFX_PSI5_CH_SDRL_SD30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD30 */
#define IFX_PSI5_CH_SDRL_SD30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD30 */
#define IFX_PSI5_CH_SDRL_SD30_OFF (30u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD31 */
#define IFX_PSI5_CH_SDRL_SD31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD31 */
#define IFX_PSI5_CH_SDRL_SD31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD31 */
#define IFX_PSI5_CH_SDRL_SD31_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_OFF (3u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_MSK (0x1u)

