luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD12 */
#define IFX_PSI5_CH_SSRL_SD12_OFF (12u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD13 */
#define IFX_PSI5_CH_SSRL_SD13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD13 */
#define IFX_PSI5_CH_SSRL_SD13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD13 */
#define IFX_PSI5_CH_SSRL_SD13_OFF (13u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD14 */
#define IFX_PSI5_CH_SSRL_SD14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD14 */
#define IFX_PSI5_CH_SSRL_SD14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD14 */
#define IFX_PSI5_CH_SSRL_SD14_OFF (14u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD15 */
#define IFX_PSI5_CH_SSRL_SD15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD15 */
#define IFX_PSI5_CH_SSRL_SD15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD15 */
#define IFX_PSI5_CH_SSRL_SD15_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD16 */
#define IFX_PSI5_CH_SSRL_SD16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD16 */
#define IFX_PSI5_CH_SSRL_SD16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD16 */
#define IFX_PSI5_CH_SSRL_SD16_OFF (16u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD17 */
#define IFX_PSI5_CH_SSRL_SD17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD17 */
#define IFX_PSI5_CH_SSRL_SD17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD17 */
#define IFX_PSI5_CH_SSRL_SD17_OFF (17u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD18 */
#define IFX_PSI5_CH_SSRL_SD18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD18 */
#define IFX_PSI5_CH_SSRL_SD18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD18 */
#define IFX_PSI5_CH_SSRL_SD18_OFF (18u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD19 */
#define IFX_PSI5_CH_SSRL_SD19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD19 */
#define IFX_PSI5_CH_SSRL_SD19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD19 */
#define IFX_PSI5_CH_SSRL_SD19_OFF (19u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD1 */
#define IFX_PSI5_CH_SSRL_SD1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD1 */
#define IFX_PSI5_CH_SSRL_SD1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD1 */
#define IFX_PSI5_CH_SSRL_SD1_OFF (1u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD20 */
#define IFX_PSI5_CH_SSRL_SD20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD20 */
#define IFX_PSI5_CH_SSRL_SD20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD20 */
#define IFX_PSI5_CH_SSRL_SD20_OFF (20u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD21 */
#define IFX_PSI5_CH_SSRL_SD21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD21 */
#define IFX_PSI5_CH_SSRL_SD21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD21 */
#define IFX_PSI5_CH_SSRL_SD21_OFF (21u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_OFF (22u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_OFF (23u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_OFF (24u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_OFF (25u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_OFF (26u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_OFF (27u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_OFF (28u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_OFF (29u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD2 */
#define IFX_PSI5_CH_SSRL_SD2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD2 */
#define IFX_PSI5_CH_SSRL_SD2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD2 */
#define IFX_PSI5_CH_SSRL_SD2_OFF (2u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_OFF (30u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD3 */
#define IFX_PSI5_CH_SSRL_SD3_LEN (1u)

