luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI1 */
#define IFX_PSI5_CRCIOV_CRCI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI1 */
#define IFX_PSI5_CRCIOV_CRCI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI1 */
#define IFX_PSI5_CRCIOV_CRCI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI2 */
#define IFX_PSI5_CRCIOV_CRCI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI2 */
#define IFX_PSI5_CRCIOV_CRCI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI2 */
#define IFX_PSI5_CRCIOV_CRCI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI31 */
#define IFX_PSI5_CRCIOV_CRCI31_LEN (1u)

