luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI23 */
#define IFX_PSI5_CRCISET_CRCI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI23 */
#define IFX_PSI5_CRCISET_CRCI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI24 */
#define IFX_PSI5_CRCISET_CRCI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI24 */
#define IFX_PSI5_CRCISET_CRCI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI24 */
#define IFX_PSI5_CRCISET_CRCI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI25 */
#define IFX_PSI5_CRCISET_CRCI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI25 */
#define IFX_PSI5_CRCISET_CRCI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI25 */
#define IFX_PSI5_CRCISET_CRCI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI26 */
#define IFX_PSI5_CRCISET_CRCI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI26 */
#define IFX_PSI5_CRCISET_CRCI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI26 */
#define IFX_PSI5_CRCISET_CRCI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI27 */
#define IFX_PSI5_CRCISET_CRCI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI27 */
#define IFX_PSI5_CRCISET_CRCI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI27 */
#define IFX_PSI5_CRCISET_CRCI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI3 */
#define IFX_PSI5_CRCISET_CRCI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI3 */
#define IFX_PSI5_CRCISET_CRCI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI3 */
#define IFX_PSI5_CRCISET_CRCI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI4 */
#define IFX_PSI5_CRCISET_CRCI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI4 */
#define IFX_PSI5_CRCISET_CRCI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI4 */
#define IFX_PSI5_CRCISET_CRCI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI5 */
#define IFX_PSI5_CRCISET_CRCI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI5 */
#define IFX_PSI5_CRCISET_CRCI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI5 */
#define IFX_PSI5_CRCISET_CRCI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI6 */
#define IFX_PSI5_CRCISET_CRCI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI6 */
#define IFX_PSI5_CRCISET_CRCI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI6 */
#define IFX_PSI5_CRCISET_CRCI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI7 */
#define IFX_PSI5_CRCISET_CRCI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI7 */
#define IFX_PSI5_CRCISET_CRCI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI7 */
#define IFX_PSI5_CRCISET_CRCI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI8 */
#define IFX_PSI5_CRCISET_CRCI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI8 */
#define IFX_PSI5_CRCISET_CRCI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI8 */
#define IFX_PSI5_CRCISET_CRCI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI9 */
#define IFX_PSI5_CRCISET_CRCI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI9 */
#define IFX_PSI5_CRCISET_CRCI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI9 */
#define IFX_PSI5_CRCISET_CRCI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_LEN (2u)

/** \brief  Mask for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_MSK (0x3u)

/** \brief  Offset for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_OFF (14u)

/** \brief  Length for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_LEN (10u)

/** \brief  Mask for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_MSK (0x3ffu)

/** \brief  Offset for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_OFF (16u)

/** \brief  Length for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_LEN (10u)

/** \brief  Mask for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_MSK (0x3ffu)

/** \brief  Offset for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_OFF (0u)

/** \brief  Length for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_LEN (2u)

/** \brief  Mask for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_MSK (0x3u)

/** \brief  Offset for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_OFF (14u)

/** \brief  Length for Ifx_PSI5_FDRT_Bits.ECEA */
#define IFX_PSI5_FDRT_ECEA_LEN (1u)

/** \brief  Mask for Ifx_PSI5_FDRT_Bits.ECEA */
#define IFX_PSI5_FDRT_ECEA_MSK (0x1u)

