luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_FDRT_Bits.ECEA */
#define IFX_PSI5_FDRT_ECEA_OFF (29u)

/** \brief  Length for Ifx_PSI5_FDRT_Bits.ECEB */
#define IFX_PSI5_FDRT_ECEB_LEN (1u)

/** \brief  Mask for Ifx_PSI5_FDRT_Bits.ECEB */
#define IFX_PSI5_FDRT_ECEB_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_FDRT_Bits.ECEB */
#define IFX_PSI5_FDRT_ECEB_OFF (30u)

/** \brief  Length for Ifx_PSI5_FDRT_Bits.ECEC */
#define IFX_PSI5_FDRT_ECEC_LEN (1u)

/** \brief  Mask for Ifx_PSI5_FDRT_Bits.ECEC */
#define IFX_PSI5_FDRT_ECEC_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_FDRT_Bits.ECEC */
#define IFX_PSI5_FDRT_ECEC_OFF (31u)

/** \brief  Length for Ifx_PSI5_FDRT_Bits.ECS */
#define IFX_PSI5_FDRT_ECS_LEN (3u)

/** \brief  Mask for Ifx_PSI5_FDRT_Bits.ECS */
#define IFX_PSI5_FDRT_ECS_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_FDRT_Bits.ECS */
#define IFX_PSI5_FDRT_ECS_OFF (26u)

/** \brief  Length for Ifx_PSI5_FDRT_Bits.RESULT */
#define IFX_PSI5_FDRT_RESULT_LEN (10u)

/** \brief  Mask for Ifx_PSI5_FDRT_Bits.RESULT */
#define IFX_PSI5_FDRT_RESULT_MSK (0x3ffu)

/** \brief  Offset for Ifx_PSI5_FDRT_Bits.RESULT */
#define IFX_PSI5_FDRT_RESULT_OFF (16u)

/** \brief  Length for Ifx_PSI5_FDRT_Bits.STEP */
#define IFX_PSI5_FDRT_STEP_LEN (10u)

/** \brief  Mask for Ifx_PSI5_FDRT_Bits.STEP */
#define IFX_PSI5_FDRT_STEP_MSK (0x3ffu)

/** \brief  Offset for Ifx_PSI5_FDRT_Bits.STEP */
#define IFX_PSI5_FDRT_STEP_OFF (0u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.CEN0 */
#define IFX_PSI5_GCR_CEN0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.CEN0 */
#define IFX_PSI5_GCR_CEN0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.CEN0 */
#define IFX_PSI5_GCR_CEN0_OFF (16u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.CEN1 */
#define IFX_PSI5_GCR_CEN1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.CEN1 */
#define IFX_PSI5_GCR_CEN1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.CEN1 */
#define IFX_PSI5_GCR_CEN1_OFF (17u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.CEN2 */
#define IFX_PSI5_GCR_CEN2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.CEN2 */
#define IFX_PSI5_GCR_CEN2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.CEN2 */
#define IFX_PSI5_GCR_CEN2_OFF (18u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.CEN3 */
#define IFX_PSI5_GCR_CEN3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.CEN3 */
#define IFX_PSI5_GCR_CEN3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.CEN3 */
#define IFX_PSI5_GCR_CEN3_OFF (19u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.CEN4 */
#define IFX_PSI5_GCR_CEN4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.CEN4 */
#define IFX_PSI5_GCR_CEN4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.CEN4 */
#define IFX_PSI5_GCR_CEN4_OFF (20u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.CRCI */
#define IFX_PSI5_GCR_CRCI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.CRCI */
#define IFX_PSI5_GCR_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.CRCI */
#define IFX_PSI5_GCR_CRCI_OFF (0u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.ETC0 */
#define IFX_PSI5_GCR_ETC0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.ETC0 */
#define IFX_PSI5_GCR_ETC0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.ETC0 */
#define IFX_PSI5_GCR_ETC0_OFF (8u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.ETC1 */
#define IFX_PSI5_GCR_ETC1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.ETC1 */
#define IFX_PSI5_GCR_ETC1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.ETC1 */
#define IFX_PSI5_GCR_ETC1_OFF (9u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.ETC2 */
#define IFX_PSI5_GCR_ETC2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.ETC2 */
#define IFX_PSI5_GCR_ETC2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.ETC2 */
#define IFX_PSI5_GCR_ETC2_OFF (10u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.ETC3 */
#define IFX_PSI5_GCR_ETC3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.ETC3 */
#define IFX_PSI5_GCR_ETC3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.ETC3 */
#define IFX_PSI5_GCR_ETC3_OFF (11u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.ETC4 */
#define IFX_PSI5_GCR_ETC4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.ETC4 */
#define IFX_PSI5_GCR_ETC4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.ETC4 */
#define IFX_PSI5_GCR_ETC4_OFF (12u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.MEI */
#define IFX_PSI5_GCR_MEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.MEI */
#define IFX_PSI5_GCR_MEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.MEI */
#define IFX_PSI5_GCR_MEI_OFF (2u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.NBI */
#define IFX_PSI5_GCR_NBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.NBI */
#define IFX_PSI5_GCR_NBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.NBI */
#define IFX_PSI5_GCR_NBI_OFF (1u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.NFI */
#define IFX_PSI5_GCR_NFI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.NFI */
#define IFX_PSI5_GCR_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.NFI */
#define IFX_PSI5_GCR_NFI_OFF (3u)

/** \brief  Length for Ifx_PSI5_GCR_Bits.TEI */
#define IFX_PSI5_GCR_TEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_GCR_Bits.TEI */
#define IFX_PSI5_GCR_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_GCR_Bits.TEI */
#define IFX_PSI5_GCR_TEI_OFF (4u)

/** \brief  Length for Ifx_PSI5_ID_Bits.MODNUMBER */
#define IFX_PSI5_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_PSI5_ID_Bits.MODNUMBER */
#define IFX_PSI5_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_PSI5_ID_Bits.MODNUMBER */
#define IFX_PSI5_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_PSI5_ID_Bits.MODREV */
#define IFX_PSI5_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_PSI5_ID_Bits.MODREV */
#define IFX_PSI5_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_PSI5_ID_Bits.MODREV */
#define IFX_PSI5_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_PSI5_ID_Bits.MODTYPE */
#define IFX_PSI5_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_PSI5_ID_Bits.MODTYPE */
#define IFX_PSI5_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_PSI5_ID_Bits.MODTYPE */
#define IFX_PSI5_ID_MODTYPE_OFF (8u)

