luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.CRCI */
#define IFX_PSI5_INTSETA_CRCI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.CRCI */
#define IFX_PSI5_INTSETA_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.CRCI */
#define IFX_PSI5_INTSETA_CRCI_OFF (6u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.FWI */
#define IFX_PSI5_INTSETA_FWI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.FWI */
#define IFX_PSI5_INTSETA_FWI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.FWI */
#define IFX_PSI5_INTSETA_FWI_OFF (7u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.MEI */
#define IFX_PSI5_INTSETA_MEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.MEI */
#define IFX_PSI5_INTSETA_MEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.MEI */
#define IFX_PSI5_INTSETA_MEI_OFF (5u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.NBI */
#define IFX_PSI5_INTSETA_NBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.NBI */
#define IFX_PSI5_INTSETA_NBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.NBI */
#define IFX_PSI5_INTSETA_NBI_OFF (4u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.NFI */
#define IFX_PSI5_INTSETA_NFI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.NFI */
#define IFX_PSI5_INTSETA_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.NFI */
#define IFX_PSI5_INTSETA_NFI_OFF (16u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.RBI */
#define IFX_PSI5_INTSETA_RBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.RBI */
#define IFX_PSI5_INTSETA_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.RBI */
#define IFX_PSI5_INTSETA_RBI_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.RDI */
#define IFX_PSI5_INTSETA_RDI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.RDI */
#define IFX_PSI5_INTSETA_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.RDI */
#define IFX_PSI5_INTSETA_RDI_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.RMI */
#define IFX_PSI5_INTSETA_RMI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.RMI */
#define IFX_PSI5_INTSETA_RMI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.RMI */
#define IFX_PSI5_INTSETA_RMI_OFF (9u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.RSI */
#define IFX_PSI5_INTSETA_RSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.RSI */
#define IFX_PSI5_INTSETA_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.RSI */
#define IFX_PSI5_INTSETA_RSI_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.RUI */
#define IFX_PSI5_INTSETA_RUI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.RUI */
#define IFX_PSI5_INTSETA_RUI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.RUI */
#define IFX_PSI5_INTSETA_RUI_OFF (8u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.TEI */
#define IFX_PSI5_INTSETA_TEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.TEI */
#define IFX_PSI5_INTSETA_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.TEI */
#define IFX_PSI5_INTSETA_TEI_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.TOI */
#define IFX_PSI5_INTSETA_TOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.TOI */
#define IFX_PSI5_INTSETA_TOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.TOI */
#define IFX_PSI5_INTSETA_TOI_OFF (14u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.TOOI */
#define IFX_PSI5_INTSETA_TOOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.TOOI */
#define IFX_PSI5_INTSETA_TOOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.TOOI */
#define IFX_PSI5_INTSETA_TOOI_OFF (15u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.TPI */
#define IFX_PSI5_INTSETA_TPI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.TPI */
#define IFX_PSI5_INTSETA_TPI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.TPI */
#define IFX_PSI5_INTSETA_TPI_OFF (10u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_OFF (11u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_OFF (13u)

/** \brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI0 */
#define IFX_PSI5_INTSETB_SCRI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI0 */
#define IFX_PSI5_INTSETB_SCRI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI0 */
#define IFX_PSI5_INTSETB_SCRI0_OFF (18u)

/** \brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI1 */
#define IFX_PSI5_INTSETB_SCRI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI1 */
#define IFX_PSI5_INTSETB_SCRI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI1 */
#define IFX_PSI5_INTSETB_SCRI1_OFF (19u)

/** \brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI2 */
#define IFX_PSI5_INTSETB_SCRI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI2 */
#define IFX_PSI5_INTSETB_SCRI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI2 */
#define IFX_PSI5_INTSETB_SCRI2_OFF (20u)

/** \brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI3 */
#define IFX_PSI5_INTSETB_SCRI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI3 */
#define IFX_PSI5_INTSETB_SCRI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI3 */
#define IFX_PSI5_INTSETB_SCRI3_OFF (21u)

/** \brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI4 */
#define IFX_PSI5_INTSETB_SCRI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI4 */
#define IFX_PSI5_INTSETB_SCRI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI4 */
#define IFX_PSI5_INTSETB_SCRI4_OFF (22u)

