luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI20 */
#define IFX_PSI5_MEICLR_MEI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI20 */
#define IFX_PSI5_MEICLR_MEI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI20 */
#define IFX_PSI5_MEICLR_MEI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI21 */
#define IFX_PSI5_MEICLR_MEI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI21 */
#define IFX_PSI5_MEICLR_MEI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI21 */
#define IFX_PSI5_MEICLR_MEI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI22 */
#define IFX_PSI5_MEICLR_MEI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI22 */
#define IFX_PSI5_MEICLR_MEI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI22 */
#define IFX_PSI5_MEICLR_MEI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI23 */
#define IFX_PSI5_MEICLR_MEI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI23 */
#define IFX_PSI5_MEICLR_MEI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI23 */
#define IFX_PSI5_MEICLR_MEI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI24 */
#define IFX_PSI5_MEICLR_MEI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI24 */
#define IFX_PSI5_MEICLR_MEI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI24 */
#define IFX_PSI5_MEICLR_MEI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI25 */
#define IFX_PSI5_MEICLR_MEI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI25 */
#define IFX_PSI5_MEICLR_MEI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI25 */
#define IFX_PSI5_MEICLR_MEI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI26 */
#define IFX_PSI5_MEICLR_MEI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI26 */
#define IFX_PSI5_MEICLR_MEI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI26 */
#define IFX_PSI5_MEICLR_MEI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI27 */
#define IFX_PSI5_MEICLR_MEI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI27 */
#define IFX_PSI5_MEICLR_MEI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI27 */
#define IFX_PSI5_MEICLR_MEI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI28 */
#define IFX_PSI5_MEICLR_MEI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI28 */
#define IFX_PSI5_MEICLR_MEI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI28 */
#define IFX_PSI5_MEICLR_MEI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI29 */
#define IFX_PSI5_MEICLR_MEI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI29 */
#define IFX_PSI5_MEICLR_MEI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI29 */
#define IFX_PSI5_MEICLR_MEI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_MSK (0x1u)

