luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI31 */
#define IFX_PSI5_NBISET_NBI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_NBISET_Bits.NBI9 */
#define IFX_PSI5_NBISET_NBI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBISET_Bits.NBI9 */
#define IFX_PSI5_NBISET_NBI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBISET_Bits.NBI9 */
#define IFX_PSI5_NBISET_NBI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI0 */
#define IFX_PSI5_NFICLR_NFI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI0 */
#define IFX_PSI5_NFICLR_NFI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI0 */
#define IFX_PSI5_NFICLR_NFI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI1 */
#define IFX_PSI5_NFICLR_NFI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI1 */
#define IFX_PSI5_NFICLR_NFI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI1 */
#define IFX_PSI5_NFICLR_NFI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_NFICLR_Bits.NFI22 */
#define IFX_PSI5_NFICLR_NFI22_LEN (1u)

