luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI19 */
#define IFX_PSI5_RDISET_RDI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI19 */
#define IFX_PSI5_RDISET_RDI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI19 */
#define IFX_PSI5_RDISET_RDI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI1 */
#define IFX_PSI5_RDISET_RDI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI1 */
#define IFX_PSI5_RDISET_RDI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI1 */
#define IFX_PSI5_RDISET_RDI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI20 */
#define IFX_PSI5_RDISET_RDI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI20 */
#define IFX_PSI5_RDISET_RDI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI20 */
#define IFX_PSI5_RDISET_RDI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI21 */
#define IFX_PSI5_RDISET_RDI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI21 */
#define IFX_PSI5_RDISET_RDI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI21 */
#define IFX_PSI5_RDISET_RDI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI22 */
#define IFX_PSI5_RDISET_RDI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI22 */
#define IFX_PSI5_RDISET_RDI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI22 */
#define IFX_PSI5_RDISET_RDI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI23 */
#define IFX_PSI5_RDISET_RDI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI23 */
#define IFX_PSI5_RDISET_RDI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI23 */
#define IFX_PSI5_RDISET_RDI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI24 */
#define IFX_PSI5_RDISET_RDI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI24 */
#define IFX_PSI5_RDISET_RDI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI24 */
#define IFX_PSI5_RDISET_RDI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI25 */
#define IFX_PSI5_RDISET_RDI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI25 */
#define IFX_PSI5_RDISET_RDI25_MSK (0x1u)

