luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI25 */
#define IFX_PSI5_RDISET_RDI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI26 */
#define IFX_PSI5_RDISET_RDI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI26 */
#define IFX_PSI5_RDISET_RDI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI26 */
#define IFX_PSI5_RDISET_RDI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI27 */
#define IFX_PSI5_RDISET_RDI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI27 */
#define IFX_PSI5_RDISET_RDI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI27 */
#define IFX_PSI5_RDISET_RDI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI28 */
#define IFX_PSI5_RDISET_RDI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI28 */
#define IFX_PSI5_RDISET_RDI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI28 */
#define IFX_PSI5_RDISET_RDI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI29 */
#define IFX_PSI5_RDISET_RDI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI29 */
#define IFX_PSI5_RDISET_RDI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI29 */
#define IFX_PSI5_RDISET_RDI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI2 */
#define IFX_PSI5_RDISET_RDI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI2 */
#define IFX_PSI5_RDISET_RDI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI2 */
#define IFX_PSI5_RDISET_RDI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI30 */
#define IFX_PSI5_RDISET_RDI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI30 */
#define IFX_PSI5_RDISET_RDI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI30 */
#define IFX_PSI5_RDISET_RDI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI31 */
#define IFX_PSI5_RDISET_RDI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI31 */
#define IFX_PSI5_RDISET_RDI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI31 */
#define IFX_PSI5_RDISET_RDI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI3 */
#define IFX_PSI5_RDISET_RDI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI3 */
#define IFX_PSI5_RDISET_RDI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI3 */
#define IFX_PSI5_RDISET_RDI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI4 */
#define IFX_PSI5_RDISET_RDI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI4 */
#define IFX_PSI5_RDISET_RDI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI4 */
#define IFX_PSI5_RDISET_RDI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI5 */
#define IFX_PSI5_RDISET_RDI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI5 */
#define IFX_PSI5_RDISET_RDI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI5 */
#define IFX_PSI5_RDISET_RDI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI6 */
#define IFX_PSI5_RDISET_RDI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI6 */
#define IFX_PSI5_RDISET_RDI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI6 */
#define IFX_PSI5_RDISET_RDI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI7 */
#define IFX_PSI5_RDISET_RDI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI7 */
#define IFX_PSI5_RDISET_RDI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI7 */
#define IFX_PSI5_RDISET_RDI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI8 */
#define IFX_PSI5_RDISET_RDI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI8 */
#define IFX_PSI5_RDISET_RDI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI8 */
#define IFX_PSI5_RDISET_RDI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RDISET_Bits.RDI9 */
#define IFX_PSI5_RDISET_RDI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDISET_Bits.RDI9 */
#define IFX_PSI5_RDISET_RDI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDISET_Bits.RDI9 */
#define IFX_PSI5_RDISET_RDI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_OFF (29u)

/** \brief  Length for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_OFF (28u)

/** \brief  Length for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_OFF (30u)

/** \brief  Length for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_OFF (31u)

/** \brief  Length for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_LEN (3u)

/** \brief  Mask for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_OFF (24u)

/** \brief  Length for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_OFF (27u)

/** \brief  Length for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_LEN (24u)

/** \brief  Mask for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_MSK (0xffffffu)

/** \brief  Offset for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_OFF (0u)

/** \brief  Length for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_LEN (3u)

/** \brief  Mask for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_OFF (1u)

/** \brief  Length for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_OFF (0u)

/** \brief  Length for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_LEN (28u)

/** \brief  Mask for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_MSK (0xfffffffu)

/** \brief  Offset for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_OFF (4u)

/** \brief  Length for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_LEN (1u)

