luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_OFF (31u)

/** \brief  Length for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_OFF (30u)

/** \brief  Length for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_LEN (5u)

/** \brief  Mask for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_MSK (0x1fu)

/** \brief  Offset for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_OFF (16u)

/** \brief  Length for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_LEN (6u)

/** \brief  Mask for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_MSK (0x3fu)

/** \brief  Offset for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_OFF (0u)

/** \brief  Length for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_OFF (29u)

/** \brief  Length for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_LEN (6u)

/** \brief  Mask for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_MSK (0x3fu)

/** \brief  Offset for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_OFF (8u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI0 */
#define IFX_PSI5_RMICLR_RMI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI0 */
#define IFX_PSI5_RMICLR_RMI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI0 */
#define IFX_PSI5_RMICLR_RMI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI10 */
#define IFX_PSI5_RMICLR_RMI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI10 */
#define IFX_PSI5_RMICLR_RMI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI10 */
#define IFX_PSI5_RMICLR_RMI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI11 */
#define IFX_PSI5_RMICLR_RMI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI11 */
#define IFX_PSI5_RMICLR_RMI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI11 */
#define IFX_PSI5_RMICLR_RMI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI12 */
#define IFX_PSI5_RMICLR_RMI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI12 */
#define IFX_PSI5_RMICLR_RMI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI12 */
#define IFX_PSI5_RMICLR_RMI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI13 */
#define IFX_PSI5_RMICLR_RMI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI13 */
#define IFX_PSI5_RMICLR_RMI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI13 */
#define IFX_PSI5_RMICLR_RMI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI14 */
#define IFX_PSI5_RMICLR_RMI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI14 */
#define IFX_PSI5_RMICLR_RMI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI14 */
#define IFX_PSI5_RMICLR_RMI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI15 */
#define IFX_PSI5_RMICLR_RMI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI15 */
#define IFX_PSI5_RMICLR_RMI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI15 */
#define IFX_PSI5_RMICLR_RMI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI16 */
#define IFX_PSI5_RMICLR_RMI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI16 */
#define IFX_PSI5_RMICLR_RMI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI16 */
#define IFX_PSI5_RMICLR_RMI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI17 */
#define IFX_PSI5_RMICLR_RMI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI17 */
#define IFX_PSI5_RMICLR_RMI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI17 */
#define IFX_PSI5_RMICLR_RMI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI18 */
#define IFX_PSI5_RMICLR_RMI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI18 */
#define IFX_PSI5_RMICLR_RMI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI18 */
#define IFX_PSI5_RMICLR_RMI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI19 */
#define IFX_PSI5_RMICLR_RMI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI19 */
#define IFX_PSI5_RMICLR_RMI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI19 */
#define IFX_PSI5_RMICLR_RMI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI1 */
#define IFX_PSI5_RMICLR_RMI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI1 */
#define IFX_PSI5_RMICLR_RMI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI1 */
#define IFX_PSI5_RMICLR_RMI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI20 */
#define IFX_PSI5_RMICLR_RMI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI20 */
#define IFX_PSI5_RMICLR_RMI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI20 */
#define IFX_PSI5_RMICLR_RMI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI21 */
#define IFX_PSI5_RMICLR_RMI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI21 */
#define IFX_PSI5_RMICLR_RMI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI21 */
#define IFX_PSI5_RMICLR_RMI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI22 */
#define IFX_PSI5_RMICLR_RMI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI22 */
#define IFX_PSI5_RMICLR_RMI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI22 */
#define IFX_PSI5_RMICLR_RMI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI23 */
#define IFX_PSI5_RMICLR_RMI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI23 */
#define IFX_PSI5_RMICLR_RMI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI23 */
#define IFX_PSI5_RMICLR_RMI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI24 */
#define IFX_PSI5_RMICLR_RMI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI24 */
#define IFX_PSI5_RMICLR_RMI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI24 */
#define IFX_PSI5_RMICLR_RMI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI25 */
#define IFX_PSI5_RMICLR_RMI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI25 */
#define IFX_PSI5_RMICLR_RMI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI25 */
#define IFX_PSI5_RMICLR_RMI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI26 */
#define IFX_PSI5_RMICLR_RMI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI26 */
#define IFX_PSI5_RMICLR_RMI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI26 */
#define IFX_PSI5_RMICLR_RMI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI27 */
#define IFX_PSI5_RMICLR_RMI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI27 */
#define IFX_PSI5_RMICLR_RMI27_MSK (0x1u)

