luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI27 */
#define IFX_PSI5_RMICLR_RMI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI28 */
#define IFX_PSI5_RMICLR_RMI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI28 */
#define IFX_PSI5_RMICLR_RMI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI28 */
#define IFX_PSI5_RMICLR_RMI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI29 */
#define IFX_PSI5_RMICLR_RMI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI29 */
#define IFX_PSI5_RMICLR_RMI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI29 */
#define IFX_PSI5_RMICLR_RMI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI2 */
#define IFX_PSI5_RMICLR_RMI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI2 */
#define IFX_PSI5_RMICLR_RMI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI2 */
#define IFX_PSI5_RMICLR_RMI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI30 */
#define IFX_PSI5_RMICLR_RMI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI30 */
#define IFX_PSI5_RMICLR_RMI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI30 */
#define IFX_PSI5_RMICLR_RMI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI31 */
#define IFX_PSI5_RMICLR_RMI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI31 */
#define IFX_PSI5_RMICLR_RMI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI31 */
#define IFX_PSI5_RMICLR_RMI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI3 */
#define IFX_PSI5_RMICLR_RMI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI3 */
#define IFX_PSI5_RMICLR_RMI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI3 */
#define IFX_PSI5_RMICLR_RMI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI4 */
#define IFX_PSI5_RMICLR_RMI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI4 */
#define IFX_PSI5_RMICLR_RMI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI4 */
#define IFX_PSI5_RMICLR_RMI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI5 */
#define IFX_PSI5_RMICLR_RMI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI5 */
#define IFX_PSI5_RMICLR_RMI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI5 */
#define IFX_PSI5_RMICLR_RMI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI6 */
#define IFX_PSI5_RMICLR_RMI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI6 */
#define IFX_PSI5_RMICLR_RMI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI6 */
#define IFX_PSI5_RMICLR_RMI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI7 */
#define IFX_PSI5_RMICLR_RMI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI7 */
#define IFX_PSI5_RMICLR_RMI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI7 */
#define IFX_PSI5_RMICLR_RMI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI8 */
#define IFX_PSI5_RMICLR_RMI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI8 */
#define IFX_PSI5_RMICLR_RMI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI8 */
#define IFX_PSI5_RMICLR_RMI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RMICLR_Bits.RMI9 */
#define IFX_PSI5_RMICLR_RMI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI9 */
#define IFX_PSI5_RMICLR_RMI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI9 */
#define IFX_PSI5_RMICLR_RMI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_LEN (1u)

