luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI8 */
#define IFX_PSI5_RMISET_RMI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI8 */
#define IFX_PSI5_RMISET_RMI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI8 */
#define IFX_PSI5_RMISET_RMI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI9 */
#define IFX_PSI5_RMISET_RMI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI9 */
#define IFX_PSI5_RMISET_RMI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI9 */
#define IFX_PSI5_RMISET_RMI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_MSK (0x1u)

