luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI6 */
#define IFX_PSI5_RSIOV_RSI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI12 */
#define IFX_PSI5_RSISET_RSI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI12 */
#define IFX_PSI5_RSISET_RSI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI12 */
#define IFX_PSI5_RSISET_RSI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI13 */
#define IFX_PSI5_RSISET_RSI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI13 */
#define IFX_PSI5_RSISET_RSI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI13 */
#define IFX_PSI5_RSISET_RSI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI14 */
#define IFX_PSI5_RSISET_RSI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI14 */
#define IFX_PSI5_RSISET_RSI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI14 */
#define IFX_PSI5_RSISET_RSI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI15 */
#define IFX_PSI5_RSISET_RSI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI15 */
#define IFX_PSI5_RSISET_RSI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI15 */
#define IFX_PSI5_RSISET_RSI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI16 */
#define IFX_PSI5_RSISET_RSI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI16 */
#define IFX_PSI5_RSISET_RSI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI16 */
#define IFX_PSI5_RSISET_RSI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI17 */
#define IFX_PSI5_RSISET_RSI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI17 */
#define IFX_PSI5_RSISET_RSI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI17 */
#define IFX_PSI5_RSISET_RSI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI18 */
#define IFX_PSI5_RSISET_RSI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI18 */
#define IFX_PSI5_RSISET_RSI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI18 */
#define IFX_PSI5_RSISET_RSI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI19 */
#define IFX_PSI5_RSISET_RSI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI19 */
#define IFX_PSI5_RSISET_RSI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI19 */
#define IFX_PSI5_RSISET_RSI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI1 */
#define IFX_PSI5_RSISET_RSI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI1 */
#define IFX_PSI5_RSISET_RSI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI1 */
#define IFX_PSI5_RSISET_RSI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI20 */
#define IFX_PSI5_RSISET_RSI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI20 */
#define IFX_PSI5_RSISET_RSI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI20 */
#define IFX_PSI5_RSISET_RSI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI21 */
#define IFX_PSI5_RSISET_RSI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI21 */
#define IFX_PSI5_RSISET_RSI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI21 */
#define IFX_PSI5_RSISET_RSI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI22 */
#define IFX_PSI5_RSISET_RSI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI22 */
#define IFX_PSI5_RSISET_RSI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI22 */
#define IFX_PSI5_RSISET_RSI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI23 */
#define IFX_PSI5_RSISET_RSI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI23 */
#define IFX_PSI5_RSISET_RSI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI23 */
#define IFX_PSI5_RSISET_RSI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI24 */
#define IFX_PSI5_RSISET_RSI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI24 */
#define IFX_PSI5_RSISET_RSI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI24 */
#define IFX_PSI5_RSISET_RSI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI25 */
#define IFX_PSI5_RSISET_RSI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI25 */
#define IFX_PSI5_RSISET_RSI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI25 */
#define IFX_PSI5_RSISET_RSI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI26 */
#define IFX_PSI5_RSISET_RSI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI26 */
#define IFX_PSI5_RSISET_RSI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI26 */
#define IFX_PSI5_RSISET_RSI26_OFF (26u)

