luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI27 */
#define IFX_PSI5_RSISET_RSI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI27 */
#define IFX_PSI5_RSISET_RSI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI27 */
#define IFX_PSI5_RSISET_RSI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI28 */
#define IFX_PSI5_RSISET_RSI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI28 */
#define IFX_PSI5_RSISET_RSI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI28 */
#define IFX_PSI5_RSISET_RSI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI29 */
#define IFX_PSI5_RSISET_RSI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI29 */
#define IFX_PSI5_RSISET_RSI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI29 */
#define IFX_PSI5_RSISET_RSI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI2 */
#define IFX_PSI5_RSISET_RSI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI2 */
#define IFX_PSI5_RSISET_RSI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI2 */
#define IFX_PSI5_RSISET_RSI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI30 */
#define IFX_PSI5_RSISET_RSI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI30 */
#define IFX_PSI5_RSISET_RSI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI30 */
#define IFX_PSI5_RSISET_RSI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI31 */
#define IFX_PSI5_RSISET_RSI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI31 */
#define IFX_PSI5_RSISET_RSI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI31 */
#define IFX_PSI5_RSISET_RSI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI3 */
#define IFX_PSI5_RSISET_RSI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI3 */
#define IFX_PSI5_RSISET_RSI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI3 */
#define IFX_PSI5_RSISET_RSI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI4 */
#define IFX_PSI5_RSISET_RSI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI4 */
#define IFX_PSI5_RSISET_RSI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI4 */
#define IFX_PSI5_RSISET_RSI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_MSK (0x1u)

